module Gallow(
    gallow
)where
import GuessOfGallow
import Secret

gallow::IO()
gallow = do
    putStrLn $  "_______________________________________ \n"    ++
                "___$$$$$$$$$$_________________________  \n"    ++
                "___$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$___ \n"    ++
                "______Z___________________$$$$$$$______ \n"    ++
                "______Z___________________$$$$$$$______ \n"    ++
                "______Z___________________$$$$$$$______ \n"    ++
                "_____$$$__________________$$$$$$$______ \n"    ++
                "____$$$$$_________________$$$$$$$______ \n"    ++
                "_____$$$__________________$$$$$$$______ \n"    ++
                "___$ZZZZZ$________________$$$$$$$______ \n"    ++
                "__$$$$$$$$$_______________$$$$$$$______ \n"    ++
                "__$_$$$$$_$_______________$$$$$$$______ \n"    ++
                "__$_$$$$$_$_______________$$$$$$$______ \n"    ++
                "__$_$$$$$_$_______________$$$$$$$______ \n"    ++
                "____$$_$$_________________$$$$$$$______ \n"    ++
                "___$$___$$________________$$$$$$$______ \n"    ++
                "___$$___$$________________$$$$$$$______ \n"    ++
                "___$$___$$_____________$$$$$$$$$$$$$___ \n"    ++
                "$__$$___$$__$$$$$$$$$$$$$$$$$$$$$$$$$$$ \n"    ++
                "_\_________/_______$$$$$$$$$$$$$$$$$$$$$ \n"   ++
                "__\_______/________$$$$$$$$$$$$$$$$$$$$$ \n"   ++
                "__________________$$$$$$$$$$$$$$$$$$$$$ \n"    ++
                "__________________$$$$$$$$$$$$$$$$$$$$$ \n"
    putStrLn $  "Я загадаю слово и отмечу символами '_' места для букв. Ты будешь предлагать букву, которая может входить\n"        ++
                "в это слово. Если такая буква есть в слове, то я напишу её вместо соответствующей черты. Все слова подобраны\n"    ++
                "так, что каждая буква встречается в них один раз. За каждый неправильный ответ я буду добавлять одну часть\n"      ++
                "туловища к виселице. Ты будешь угадывать до тех пор, пока не отгадаешь всё слово. Если туловище в виселице\n"      ++
                "нарисовано полностью, то отгадывающий игрок проигрывает, считается повешенным.\n"                                  ++
                "Начнём."
    secret <- getSecretWord
    putStrLn "Я загадал слово из пяти букв."
    let onScreen = "_____"
    guess secret onScreen 0
